IDEA Open Model
Element1D.CrossSectionBegin Property
Compatible with IDEA StatiCa v 10.1
 Gets, sets cross section located in the begining of this element1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public ReferenceElement CrossSectionBegin { get; set; }
Public Property CrossSectionBegin As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ CrossSectionBegin {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace